// pages/seatSystem/library/library.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    text_p1:"江西农业大学图书馆，原名江西共产主义劳动大学图书馆。1969年9月由江西农学院图书馆和江西共产主义劳动大学图书馆合并而成，1980年11月21日易名为江西农业大学图书馆。是江西省高等学校图书情报工作委员会常务委员馆单位、江西省高校图书馆自动化专业委员会主任委员单位、中国农学会图书馆分会常务理事单位、中国农学会科技情报分会理事单位。",
    text_p2:"场馆面积占地面积5200平方米，馆舍面积达14000平方米。场馆部门馆内设有资源建设部、流通部、信息技术部、参考咨询部和办公室。场馆人员2014年9月图书馆在职人员94人，其中本科以上学历45人，具有高级以上职称16人。",
    text_p3:"资源重点：图书馆在文献资源建设中始终把农业和生物技术文献作为收藏重点，注重对校内重点学科和研究生学位授予点的文献收集及江西省出版的农业文献、地方性基础资料的采集工作，同时兼顾其他学科文献的系统收集，现已形成具有本校学科特点和地方农业特色的多学科、多层次综合性藏书体系。图书资源截止2013年年底，全校纸质图书达122.02万册。电子资源电子图书52.25万册，拥有中外文数据库20多个。此外，图书馆还购进了大量的外语学习软件、英文电影VCD和一些专家讲座，利用网上信息资源发布系统在校园网上发布。数据库资源自建了江西农业大学硕博学位论文数据库、鄱阳湖生态经济区资源数据库等特色资源，这些资源是校园网中重要的信息资源。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})